content/how.org
#+TITLE: How is this site made?
#+INCLUDE: "./header.org"

* How does this site work?

A few people have asked me about how I manage this site. It changes
frequently, as I will often throw stuff up very quickly, move it
around, and take it down again.

The whole system is managed by editing local files in Emacs and then a
couple of quick keystrokes push out any changes to free web-hosting on
GitHub. I'll explain each of the pieces in turn.


* It Starts with Org Mode

Org-mode is a part of Emacs, and is a whole ecosystem for, well,
organizing information. [[https://orgmode.org/][Org]] files are just plain text with some
formatting conventions that superficially are not unlike
[[https://en.wikipedia.org/wiki/Markdown][Markdown]]. Here's an example:

#+BEGIN_SRC code
,* How does this site work?

A few people have asked me about how I manage this site. It changes
frequently, as I will often throw stuff up very quickly, move it
around, and take it down again.

The whole system is managed by editing local files in Emacs and then a
couple of quick keystrokes push out any changes to free web-hosting on
GitHub. I'll explain each of the pieces in turn.


,* It Starts with Org Mode

Org-mode is a part of Emacs, and is a whole ecosystem for, well,
organizing information. [[https://orgmode.org/][Org]] files are just plain text with some
formatting conventions that superficially are not unlike
[[https://en.wikipedia.org/wiki/Markdown][Markdown]]. Here's an example:
#+END_SRC

That is the exact content that this page starts with. Because I spend
most of my day in Emacs already (see [[https://stuff.sigvaldason.com/email.html][email]]), it is super easy to just
pop into an org file, make some edits (or create a new file) and
automatically push the changes out to "production".

You can produce a lot of different formats in Org-mode very easily. For example:

#+BEGIN_SRC code

,*bold*, _underline_, +strikethrough+, /italics/

| n | n^2 | n^3 |
|---+-----+-----|
| 1 |   1 |   1 |
| 2 |   4 |   8 |
| 3 |   9 |  27 |

$y=x^2$
#+END_SRC

produces:

*bold*, _underline_, +strikethrough+, /italics/

| n | n^2 | n^3 |
|---+-----+-----|
| 1 |   1 |   1 |
| 2 |   4 |   8 |
| 3 |   9 |  27 |

$y=x^2$

This is just scratching the surface or Org-mode. To quote from the [[https://orgmode.org/worg/org-faq.html][Org FAQ]]:

#+BEGIN_QUOTE
In its default setup, Org-mode offers a simple outlining and task
management environment. But it also has a huge number of features and
settings "under the hood." Advanced users have configured Org-mode for
almost every conceivable use scenario.
#+END_QUOTE


