how.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=0.5" />
<title>How is this site made?</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css"/>
                                            <link rel="stylesheet" type="text/css" href="/static/css/customizations.css" />
                                            <link rel="stylesheet" type="text/css" href="/static/css/org-html-styling.css" />

</head>
<body>
<div id="content" class="content">
<header>
  <h1>Stuff</h1>
  <p><i>noun</i> 1. things which need to be put somewhere.</p>
  <div class="topbar-menu-container">
    <span><a href="/index.html">home</a></span> |
    <!--  <span><a href="/enough.html">enough</a></span> | --!>
    <span><a href="/itch.html">itch</a></span> | 
    <span><a href="/email.html">email</a></span> | 
    <span><a href="/totp.html">totp</a></span> | 
    <span><a href="/Books/RootsThatBind/">roots</a></span> | 
    <span><a href="/pta.html">pta</a></span> | 
    <span><a href="/how.html">how?</a></span> 
  </div>
</header>
<div id="outline-container-org7884d3c" class="outline-2">
<h2 id="org7884d3c">How does this site work?</h2>
<div class="outline-text-2" id="text-org7884d3c">
<p>
A few people have asked me about how I manage this site. It changes
frequently, as I will often throw stuff up very quickly, move it
around, and take it down again.
</p>

<p>
The whole system is managed by editing local files in Emacs and then a
couple of quick keystrokes push out any changes to free web-hosting on
GitHub. I'll explain each of the pieces in turn.
</p>
</div>
</div>


<div id="outline-container-org54bc895" class="outline-2">
<h2 id="org54bc895">It Starts with Org Mode</h2>
<div class="outline-text-2" id="text-org54bc895">
<p>
Org-mode is a part of Emacs, and is a whole ecosystem for, well,
organizing information. <a href="https://orgmode.org/">Org</a> files are just plain text with some
formatting conventions that superficially are not unlike
<a href="https://en.wikipedia.org/wiki/Markdown">Markdown</a>. Here's an example:
</p>

<div class="org-src-container">
<pre class="src src-code">* How does this site work?

A few people have asked me about how I manage this site. It changes
frequently, as I will often throw stuff up very quickly, move it
around, and take it down again.

The whole system is managed by editing local files in Emacs and then a
couple of quick keystrokes push out any changes to free web-hosting on
GitHub. I'll explain each of the pieces in turn.


* It Starts with Org Mode

Org-mode is a part of Emacs, and is a whole ecosystem for, well,
organizing information. [[https://orgmode.org/][Org]] files are
just plain text with some formatting conventions that superficially
are not unlike [[https://en.wikipedia.org/wiki/Markdown][Markdown]].
Here's an example:
</pre>
</div>

<p>
That is the exact content that this page starts with. Because I spend
most of my day in Emacs already (see <a href="https://stuff.sigvaldason.com/email.html">email</a>), it is super easy to just
pop into an org file, make some edits (or create a new file) and
automatically push the changes out to "production".
</p>

<p>
You can specify a lot of different formats in Org-mode very easily. For example:
</p>

<div class="org-src-container">
<pre class="src src-code">
*bold*, _underline_, +strikethrough+, /italics/

| n | n^2 | n^3 |
|---+-----+-----|
| 1 |   1 |   1 |
| 2 |   4 |   8 |
| 3 |   9 |  27 |

$y=x^2$
</pre>
</div>

<p>
produces:
</p>

<p>
<b>bold</b>, <span class="underline">underline</span>, <del>strikethrough</del>, <i>italics</i>
</p>

<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">n</th>
<th scope="col" class="org-right">n<sup>2</sup></th>
<th scope="col" class="org-right">n<sup>3</sup></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">9</td>
<td class="org-right">27</td>
</tr>
</tbody>
</table>

<p>
\(y=x^2\)
</p>

<p>
This is just scratching the surface or Org-mode. To quote from the <a href="https://orgmode.org/worg/org-faq.html">Org FAQ</a>:
</p>

<blockquote>
<p>
In its default setup, Org-mode offers a simple outlining and task
management environment. But it also has a huge number of features and
settings "under the hood." Advanced users have configured Org-mode for
almost every conceivable use scenario.
</p>
</blockquote>
</div>
</div>
