content/how.org
* Add in Some Packages

Emacs has a notion of packages, and there a few available for
automating the translation of org files into html. In fact, Org-mode
has built-in exporting to a number of different formats, including
$\LaTeX$, PDF, ODT/Word, and html. While the default html output from
Org is serviceable, there is a more powerful package available that is
more flexible, produces nicer html output, and helps keep various
ancillary files organized.

The main package for this is ox-publish, which is really part of
Org-mode itself. You can create an elisp file (a bit of interpretable
code written in Emac's own variant of the Lisp programming language)
that:

1. Makes sure ox-publish is in place

2. Describes where the source (.org) files for the site are located (relative to the directory where the elisp script is).

3. Describes the "publishing" directory where html output files should end up.

4. Sets various other optional parameters (e.g. css style sheets to use, etc.)

5. Runs the actual page creation process.

Then, any time you make any edits or structural changes to the
underlying org document, you just invoke this script to automagically
process all the changes.

There are many other things you can do within ox-publish. The exact
script I use for this site is in the code block below, and I include
resources at the end of this document where you can find more details
on all the configuration options available.

#+BEGIN_SRC elisp

;;
;; Bring in the package system (elpa/melpa), make sure that is not
;; messing with our normal (user) package dir but is doing so in the
;; local .packages directory, and then bring in htmlize (mostly for
;; syntax highlighting in code blocks).
;;

(require 'package)
(setq package-user-dir (expand-file-name "./.packages"))
(setq package-archives '(("melpa" . "https://melpa.org/packages/"   )
			 ("elpa"  . "https://elpa.gnu.org/packages" )))

;; Init the package system
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Install dependencies
(package-install 'htmlize)

;;
;; Load the publishing system
;;
(require 'ox-publish)

(setq org-html-validation-link             nil ;; don't show a "Validate" link at the bottom of the page
      org-html-head-include-scripts        nil ;; don't put default org-html export scripts in place
      org-html-doctype                     "html5"
      org-html-html5-fancy                 t
      org-html-head-include-default-style  nil ;; skip the default style sheet
      org-html-viewport                    '((width "device-width")
			                     (initial-scale "0.5")
			                     (minimum-scale "")
			                     (maximum-scale "")
			                     (user-scalable ""))
					     
      org-html-head                        "<link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\"/>
                                            <link rel=\"stylesheet\" type=\"text/css\" href=\"/static/css/customizations.css\" />
                                            <link rel=\"stylesheet\" type=\"text/css\" href=\"/static/css/org-html-styling.css\" />"
                                            ;; ^ This last file is generated by running org-html-htmlize-generate-css
      ;;org-html-head                       "<link rel=\"stylesheet\" href=\"https://latex.vercel.app/style.css\" />"
      ;;org-html-head                       "<link rel=\"stylesheet\" href=\"/css/latex.css\" />"
      ;;org-html-htmlize-output-type        'inline-css
      org-html-htmlize-output-type          'css
      
  )

(setq org-publish-project-alist
  (list
   (list "stuff"
     :recursive t
     :base-directory "./content"
     :base-extension "org"
     :publishing-directory "./public"
     :publishing-function 'org-html-publish-to-html
     :with-author nil
     :with-title nil
     :with-creator t
     :with-toc nil
     :section-numbers nil
     :time-stamp-file t)
   (list "static"
     :recursive t
     :base-directory "./static"
     :base-extension "css\\|js\\|pdf\\|png"
     :publishing-directory "./public/static"
     :publishing-function 'org-publish-attachment
     :with-author nil
     :with-title nil
     :with-creator t
     :with-toc nil
     :section-numbers nil
     :time-stamp-file t)))

(org-publish-all t)
     

(message "Build complete!")

#+END_SRC




The htmlize package is included in there so that if I have a code block in a given file, like this python file:

#+BEGIN_SRC python

from fastapi import FastAPI

app = FastAPI()

@app.get("/")
async def root():
    return {"message": "Hello, World!"}

#+END_SRC

I get syntax highlighting in the exported html automatically without having to do anything further. 
 

