how.html


<div id="outline-container-orge42ceaa" class="outline-2">
<h2 id="orge42ceaa">Add in Some Packages</h2>
<div class="outline-text-2" id="text-orge42ceaa">
<p>
Emacs has a notion of packages, and there a few available for
automating the translation of org files into html. In fact, Org-mode
has built-in exporting to a number of different formats, including
\(\LaTeX\), PDF, ODT/Word, and html. While the default html output from
Org is serviceable, there is a more powerful package available that is
more flexible, produces nicer html output, and helps keep various
ancillary files organized.
</p>

<p>
The main package for this is ox-publish, which is really part of
Org-mode itself. You can create an elisp file (a bit of interpretable
code written in Emacs's own variant of the Lisp programming language)
that:
</p>

<ol class="org-ol">
<li>Makes sure ox-publish is in place</li>

<li>Describes where the source (.org) files for the site are located (relative to the directory where the elisp script is).</li>

<li>Describes the "publishing" directory where html output files should end up.</li>

<li>Sets various other optional parameters (e.g. css style sheets to use, etc.)</li>

<li>Runs the actual page creation process.</li>
</ol>

<p>
Then, any time you make any edits or structural changes to the
underlying org document, you just invoke this script to automagically
process all the changes.
</p>

<p>
There are many other things you can do within ox-publish. The exact
script I use for this site is in the code block below, and I include
resources at the end of this document where you can find more details
on all the configuration options available.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
<span class="org-comment-delimiter">;;</span><span class="org-comment">
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Bring in the package system (elpa/melpa), make sure that is not
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">messing with our normal (user) package dir but is doing so in the
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">local .packages directory, and then bring in htmlize (mostly for
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">syntax highlighting in code blocks).
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">
</span>
(<span class="org-keyword">require</span> '<span class="org-constant">package</span>)
(<span class="org-keyword">setq</span> package-user-dir (expand-file-name <span class="org-string">"./.packages"</span>))
(<span class="org-keyword">setq</span> package-archives '((<span class="org-string">"melpa"</span> . <span class="org-string">"https://melpa.org/packages/"</span>   )
                         (<span class="org-string">"elpa"</span>  . <span class="org-string">"https://elpa.gnu.org/packages"</span> )))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Init the package system
</span>(package-initialize)
(<span class="org-keyword">unless</span> package-archive-contents
  (package-refresh-contents))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Install dependencies
</span>(package-install 'htmlize)

<span class="org-comment-delimiter">;;</span><span class="org-comment">
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Load the publishing system
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">
</span>(<span class="org-keyword">require</span> '<span class="org-constant">ox-publish</span>)

(<span class="org-keyword">setq</span> org-html-validation-link             nil <span class="org-comment-delimiter">;; </span><span class="org-comment">don't show a "Validate" link at the bottom of the page
</span>      org-html-head-include-scripts        nil <span class="org-comment-delimiter">;; </span><span class="org-comment">don't put default org-html export scripts in place
</span>      org-html-doctype                     <span class="org-string">"html5"</span>
      org-html-html5-fancy                 t
      org-html-head-include-default-style  nil <span class="org-comment-delimiter">;; </span><span class="org-comment">skip the default style sheet
</span>      org-html-viewport                    '((width <span class="org-string">"device-width"</span>)
                                             (initial-scale <span class="org-string">"0.5"</span>)
                                             (minimum-scale <span class="org-string">""</span>)
                                             (maximum-scale <span class="org-string">""</span>)
                                             (user-scalable <span class="org-string">""</span>))

      org-html-head                        <span class="org-string">"&lt;link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\"/&gt;
                                            &lt;link rel=\"stylesheet\" type=\"text/css\" href=\"/static/css/customizations.css\" /&gt;
                                            &lt;link rel=\"stylesheet\" type=\"text/css\" href=\"/static/css/org-html-styling.css\" /&gt;"</span>
                                            <span class="org-comment-delimiter">;; </span><span class="org-comment">^ This last file is generated by running org-html-htmlize-generate-css
</span>      <span class="org-comment-delimiter">;;</span><span class="org-comment">org-html-head                       "&lt;link rel=\"stylesheet\" href=\"https://latex.vercel.app/style.css\" /&gt;"
</span>      <span class="org-comment-delimiter">;;</span><span class="org-comment">org-html-head                       "&lt;link rel=\"stylesheet\" href=\"/css/latex.css\" /&gt;"
</span>      <span class="org-comment-delimiter">;;</span><span class="org-comment">org-html-htmlize-output-type        'inline-css
</span>      org-html-htmlize-output-type          'css

  )

(<span class="org-keyword">setq</span> org-publish-project-alist
  (list
   (list <span class="org-string">"stuff"</span>
     <span class="org-builtin">:recursive</span> t
     <span class="org-builtin">:base-directory</span> <span class="org-string">"./content"</span>
     <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
     <span class="org-builtin">:publishing-directory</span> <span class="org-string">"./public"</span>
     <span class="org-builtin">:publishing-function</span> 'org-html-publish-to-html
     <span class="org-builtin">:with-author</span> nil
     <span class="org-builtin">:with-title</span> nil
     <span class="org-builtin">:with-creator</span> t
     <span class="org-builtin">:with-toc</span> nil
     <span class="org-builtin">:section-numbers</span> nil
     <span class="org-builtin">:time-stamp-file</span> t)
   (list <span class="org-string">"static"</span>
     <span class="org-builtin">:recursive</span> t
     <span class="org-builtin">:base-directory</span> <span class="org-string">"./static"</span>
     <span class="org-builtin">:base-extension</span> <span class="org-string">"css</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">js</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">pdf</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">png"</span>
     <span class="org-builtin">:publishing-directory</span> <span class="org-string">"./public/static"</span>
     <span class="org-builtin">:publishing-function</span> 'org-publish-attachment
     <span class="org-builtin">:with-author</span> nil
     <span class="org-builtin">:with-title</span> nil
     <span class="org-builtin">:with-creator</span> t
     <span class="org-builtin">:with-toc</span> nil
     <span class="org-builtin">:section-numbers</span> nil
     <span class="org-builtin">:time-stamp-file</span> t)))

(org-publish-all t)


(message <span class="org-string">"Build complete!"</span>)

</pre>
</div>




<p>
The htmlize package is included in there so that if I have a code block in a given file, like this python file:
</p>

<div class="org-src-container">
<pre class="src src-python">
<span class="org-keyword">from</span> fastapi <span class="org-keyword">import</span> FastAPI

<span class="org-variable-name">app</span> <span class="org-operator">=</span> FastAPI()

<span class="org-type">@app.get</span>(<span class="org-string">"/"</span>)
<span class="org-keyword">async def</span> <span class="org-function-name">root</span>():
    <span class="org-keyword">return</span> {<span class="org-string">"message"</span>: <span class="org-string">"Hello, World!"</span>}

</pre>
</div>

<p>
I get syntax highlighting in the exported html automatically without having to do anything further. 
</p>
</div>
</div>
