content/how.org
* Hosting at Github (plus Actions)

Everything up to this point has been about creating content in org
format and then automatically converting it into nice looking html. To
host it at github, we need a couple of more pieces in place.

The first step is to get a [[https://github.com/signup][github account]]. Even if you already have an
account for other purposes, it might make sense to have a separate one
just for hosting a site (it's somewhat more complicated to juggle
projects, repositories, and github pages when you only want to host a
wesbsite for one repository from a given account, but it can [[https://deanattali.com/blog/multiple-github-pages-domains/][be done]]).

Once you've got the github account setup, you should create a
repository in that account with a name that consists of your username
plus "github.io", like this:

\nbsp{}\nbsp{}\nbsp{}\nbsp{} */username/.github.io*

Then use git (or the Emacs module [[https://magit.vc/][magit]]) to sync all the org files,
directory structure, build script, etc. to the newly created
repository.

Now you can take advantage of github's free web-hosting service
(called [[https://pages.github.com/][Github Pages]]) to serve the files via a "Continuous
Integration" (CI) process. CI is often spoken of in hushed tones that
suggest complex processes involving infrastructure and platform
systems to automatically deploy very sophisticated systems. All it
means in this context is that github will automatically run a script
every time you push new changes to the repository. In particular, if
you make a directory inside *.github* called *workflows*, any
yaml file placed in there will automatically be processed by github
after a push. So if we have a file like this called *./github/workflows/publish.yml*:

#+BEGIN_SRC elisp

name: Publish to GitHub Pages

on: [push]
      
permissions:
  contents: write

jobs:
  publish:
    runs-on: ubuntu-latest
    steps:
      - name: Check out
        uses: actions/checkout@v1

      - name: Install Emacs
        run: sudo apt install emacs-nox --yes

      - name: Build the site
        run: ./build.sh

      - name: Publish generated content to GitHub Pages
        uses: JamesIves/github-pages-deploy-action@v4
        with:
          folder: public


#+END_SRC

Processing that yaml will invoke a virtual machine at github running
ubuntu ("*runs-on: ubuntu-latest*"). On that vm, we will actually
quickly install emacs ("*run: sudo apt install emacs-nox --yes*") and
then run a script ("*run ./build.sh*:) which is just a shell wrapper
around the ox-publish script from above. It looks like this:

#+BEGIN_SRC org
#!/bin/sh
emacs -Q --script build-site.el
#+END_SRC

This will then regenerate all the site content in the *./public*
directory of our repository. The yaml file then says to use a very
popular github action (defined in
*JamesIves/github-pages-deploy-action@v4*) to push the content in the
*/public* directory to the GitHub Pages site for this repository. The
site should then be available at */username/.github.io*.

All of that may sound a little complicated, with CI yaml invocations
of virtual machines, build scripts and whatnot. But once you've
wrapped your head around it once and got it set up, it's all fully
automated from them on.


* Custom Domain Name

The last little detail on this is how to have a custom domain name
point at the github hosted content. This is actually well documented on github at:

- [[https://docs.github.com/en/pages/configuring-a-custom-domain-for-your-github-pages-site/managing-a-custom-domain-for-your-github-pages-site][Managing a custom domain for your GitHub Pages site]]

You can use those instructions to set up either an APEX name
(e.g. *example.com*) or a subdomain (e.g. *foo.example.com*). The main
caveat to be aware of is that when you first configure the domain name
on github's Settings page, you should wait 24 hours or so before
turning on https enforcing. Even in this day and age, DNS propagation
can take a while, and that all has to be working correctly and
distributed out before the https setting will work.

If you need somewhere to register a domain, I've had good luck with [[https://namecheap.com][namecheap]] and [[https://porkbun.com/][porkbun]].


* Worth It?

If you've never used Emacs and/or org-mode, it might seem like a *lot*
of upfront work to get over the mountain of Emacs just so you can
easily manage the molehill of pushing out website updates.

I actually came to Emacs after roughly 20 years of using joe ([[https://joe-editor.sourceforge.io/][Joe's
Own Editor]]), and some of my muscle memory for text editing was so
deeply ingrained that I had to customize emacs to mimic many of joe's
keystrokes.

But whatever path you take to get to Emacs, it will almost certainly
be worth it. If you are an engineer, developer, or other technical
user, Emacs (plus Org-mode, dired, mu4e, git/magit, etc., etc.) is
just such a powerful tool that is worth learning to use well. If the
path happens to start with wanting to manage a website in Org-mode,
there are worse ways to begin the journey.

And once it is all in place, you can push changes or new content to a
site so quickly that it becomes almost second nature.


* Resources

The amazing [[https://systemcrafters.net/][System Crafters]] website has a whole series of videos
related to Emacs, and a section devoted to website publishing with
Emacs:

- [[https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site][Build Your Website with Org Mode]]
- [[https://systemcrafters.net/publishing-websites-with-org-mode/automated-site-publishing/][Automated Org Mode Website Publishing with GitHub or SourceHut]]

The above link covers using ox-publish quite extensively, and if you
examine the setup they walk through, you'll see it was the source for
a lot of what I implemented.

There's also another guide to using ox-publish on the Org-mode website
here:

- [[https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html][Publishing Org-mode files to HTML]]

  
