how.html


<div id="outline-container-org594287d" class="outline-2">
<h2 id="org594287d">Hosting at Github (plus Actions)</h2>
<div class="outline-text-2" id="text-org594287d">
<p>
Everything up to this point has been about creating content in org
format and then automatically converting it into nice looking html. To
host it at github, we need a couple of more pieces in place.
</p>

<p>
The first step is to get a <a href="https://github.com/signup">github account</a>. Even if you already have an
account for other purposes, it might make sense to have a separate one
just for hosting a site (it's somewhat more complicated to juggle
projects, repositories, and github pages when you only want to host a
website for one repository from a given account, but it can <a href="https://deanattali.com/blog/multiple-github-pages-domains/">be done</a>).
</p>

<p>
Once you've got the github account setup, you should create a
repository in that account with a name that consists of your username
plus "github.io", like this:
</p>

<p>
&nbsp;&nbsp;&nbsp;&nbsp; <b><i>username</i>.github.io</b>
</p>

<p>
Then use git (or the Emacs module <a href="https://magit.vc/">magit</a>) to sync all the org files,
directory structure, build script, etc. to the newly created
repository.
</p>

<p>
Now you can take advantage of github's free web-hosting service
(called <a href="https://pages.github.com/">Github Pages</a>) to serve the files via a "Continuous
Integration" (CI) process. CI is often spoken of in hushed tones that
suggest complex processes involving infrastructure and platform
systems to automatically deploy very sophisticated systems. All it
means in this context is that github will automatically run a script
every time you push new changes to the repository. In particular, if
you make a directory inside <b>.github</b> called <b>workflows</b>, any
yaml file placed in there will automatically be processed by github
after a push. So if we have a file like this called <b>./github/workflows/publish.yml</b>:
</p>

<div class="org-src-container">
<pre class="src src-elisp">
name: Publish to GitHub Pages

on: [push]

permissions:
  contents: write

jobs:
  publish:
    runs-on: ubuntu-latest
    steps:
      - name: Check out
        uses: actions/checkout@v1

      - name: Install Emacs
        run: sudo apt install emacs-nox --yes

      - name: Build the site
        run: ./build.sh

      - name: Publish generated content to GitHub Pages
        uses: JamesIves/github-pages-deploy-action@v4
        with:
          folder: public


</pre>
</div>

<p>
Processing that yaml will invoke a virtual machine at github running
ubuntu ("<b>runs-on: ubuntu-latest</b>"). On that vm, we will actually
quickly install emacs ("<b>run: sudo apt install emacs-nox &#x2013;yes</b>") and
then run a script ("<b>run ./build.sh</b>:) which is just a shell wrapper
around the ox-publish script from above. It looks like this:
</p>

<div class="org-src-container">
<pre class="src src-org">#!/bin/sh
emacs -Q --script build-site.el
</pre>
</div>

<p>
This will then regenerate all the site content in the <b>./public</b>
directory of our repository. The yaml file then says to use a very
popular github action (defined in
<b>JamesIves/github-pages-deploy-action@v4</b>) to push the content in the
<b>/public</b> directory to the GitHub Pages site for this repository. The
site should then be available at <b><i>username</i>.github.io</b>.
</p>

<p>
All of that may sound a little complicated, with CI yaml invocations
of virtual machines, build scripts and whatnot. But once you've
wrapped your head around it once and got it set up, it's all fully
automated from them on.
</p>
</div>
</div>


<div id="outline-container-org5d1a72e" class="outline-2">
<h2 id="org5d1a72e">Custom Domain Name</h2>
<div class="outline-text-2" id="text-org5d1a72e">
<p>
The last little detail on this is how to have a custom domain name
point at the github hosted content. This is actually well documented on github at:
</p>

<ul class="org-ul">
<li><a href="https://docs.github.com/en/pages/configuring-a-custom-domain-for-your-github-pages-site/managing-a-custom-domain-for-your-github-pages-site">Managing a custom domain for your GitHub Pages site</a></li>
</ul>

<p>
You can use those instructions to set up either an APEX name
(e.g. <b>example.com</b>) or a subdomain (e.g. <b>foo.example.com</b>). The main
caveat to be aware of is that when you first configure the domain name
on github's Settings page, you should wait 24 hours or so before
turning on https enforcing. Even in this day and age, DNS propagation
can take a while, and that all has to be working correctly and
distributed out before the https setting will work.
</p>

<p>
If you need somewhere to register a domain, I've had good luck with <a href="https://namecheap.com">namecheap</a> and <a href="https://porkbun.com/">porkbun</a>.
</p>
</div>
</div>


<div id="outline-container-org2f14343" class="outline-2">
<h2 id="org2f14343">Worth It?</h2>
<div class="outline-text-2" id="text-org2f14343">
<p>
If you've never used Emacs and/or org-mode, it might seem like a <b>lot</b>
of upfront work to get over the mountain of Emacs just so you can
easily manage the molehill of pushing out website updates.
</p>

<p>
I actually came to Emacs after roughly 20 years of using joe (<a href="https://joe-editor.sourceforge.io/">Joe's
Own Editor</a>), and some of my muscle memory for text editing was so
deeply ingrained that I had to customize emacs to mimic many of joe's
keystrokes.
</p>

<p>
But whatever path you take to get to Emacs, it will almost certainly
be worth it. If you are an engineer, developer, or other technical
user, Emacs (plus Org-mode, dired, mu4e, git/magit, etc., etc.) is
just such a powerful tool that is worth learning to use well. If the
path happens to start with wanting to manage a website in Org-mode,
there are worse ways to begin the journey.
</p>

<p>
And once it is all in place, you can push changes or new content to a
site so quickly that it becomes almost second nature.
</p>
</div>
</div>


<div id="outline-container-orgcd79f5d" class="outline-2">
<h2 id="orgcd79f5d">Resources</h2>
<div class="outline-text-2" id="text-orgcd79f5d">
<p>
The amazing <a href="https://systemcrafters.net/">System Crafters</a> website has a whole series of videos
related to Emacs, and a section devoted to website publishing with
Emacs:
</p>

<ul class="org-ul">
<li><a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site">Build Your Website with Org Mode</a></li>
<li><a href="https://systemcrafters.net/publishing-websites-with-org-mode/automated-site-publishing/">Automated Org Mode Website Publishing with GitHub or SourceHut</a></li>
</ul>

<p>
The above link covers using ox-publish quite extensively, and if you
examine the setup they walk through, you'll see it was the source for
a lot of what I implemented.
</p>

<p>
There's also another guide to using ox-publish on the Org-mode website
here:
</p>

<ul class="org-ul">
<li><a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">Publishing Org-mode files to HTML</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: September  9, 2024</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
